In [2]:
import pandas as pd

In [4]:
DF1 = pd.DataFrame({'NAME':['Tomas','Maximo'],
                    'CAREER': ['Economy','Electrician'],
                    'AGE':[23,26]}).set_index('NAME')

In [5]:
DF2 = pd.DataFrame({'NAME':['Adriane','Amelie'],
                    'CAREER': ['Developer','Law'],
                    'AGE':[22,28]}).set_index('NAME')

In [6]:
DF = pd.concat([DF1,DF2])

In [8]:
DF1

             CAREER  AGE
NAME
Tomas       Economy   23
Maximo  Electrician   26

In [9]:
DF2

            CAREER  AGE
NAME
Adriane  Developer   22
Amelie         Law   28

In [10]:
DF

              CAREER  AGE
NAME
Tomas        Economy   23
Maximo   Electrician   26
Adriane    Developer   22
Amelie           Law   28